Catalogs/НастройкиПодключенияКСерверу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияКСерверу</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ODBCDriver</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Удалить</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>Удалить</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиПодключенияКСерверу/Ext/ManagerModule.bsl
//|DRIVER=" + Объект.ODBCDriver + ";
//|SERVER=" + Объект.Сервер + ";
//|DATABASE=" + Объект.НазваниеБазыДанных + "; 
//|UID=" + Пользователь + ";
//|PWD=" + ТекущийПароль + "";
Функция СтрокаСоединения(Настройка) Экспорт

	Автообзвон = ОбработкаБезопасноеХранилище.ПолучитьВсеЗначения(Настройка);
	Пользователь = Автообзвон.Пользователь;
	Пароль = Автообзвон.Пароль;
	
	Соединение = "
	|Driver={&Драйвер};
	|SERVER=&Сервер;
	|DATABASE=&База;
	|USER=&Пользователь;
	|PASSWORD=&Пароль;";
	
	Соединение = СтрЗаменить(Соединение, "&Драйвер", Настройка.ODBCDriver);
	Соединение = СтрЗаменить(Соединение, "&Сервер", Настройка.Сервер);
	Соединение = СтрЗаменить(Соединение, "&База", Настройка.НазваниеБазыДанных);
	Соединение = СтрЗаменить(Соединение, "&Пользователь", Пользователь);
	Соединение = СтрЗаменить(Соединение, "&Пароль", Пароль);
	
	Возврат Соединение;

КонецФункции // ()
